# 归一化分析

# 计算矩阵的测序深度，也就是绝对reads数量
# 
total_reads <- colSums(counts) # colSums()函数将矩阵按列求和 | column sums 

# 第2步：将绝对读数转换为相对丰度也就是相对占比（CPM，每百万条reads的counts）
# 数学公式：CPM = (该基因的counts / 该样本总reads数) * 1,000,000
# 目的：把"测得多所以数字大"的虚假影响消除。现在两列数据都在"每百万条总reads"上的reads数量
# 要注意这里不是矩阵的乘除法，而是两个DataFrame格式的数据，每一列进行相除后的结果
cpm <- counts / total_reads * 1e6

# 第3步：取以2为底的对数，并加1防零
# 目的1（+1）：防止log2(0)出现负无穷（因为有些基因可能没有reads）。
# 目的2（log2）：让数据分布更接近正态分布。在基因表达数据里，少数基因表达极高（比如看家基因），绝大多数基因表达很低。如果你直接拿 CPM 算相关性，那少数几个“刺头”基因会主导计算结果，掩盖大部分基因的真实趋势。取对数能把数据压缩到同一量级。
log_cpm <- log2(cpm + 1)

# 目的：利用cor()函数计算两个样本（列与列之间）的全局表达谱相似度，即相关系数。
# 数学本质：cor()函数默认按列计算，返回一个2行2列的矩阵。主对角线永远是1（自身和自己完全相关），
# 非对角线（第1行第2列）就是你要的冷胁迫 vs 对照的相关系数。
cor_matrix <- cor(log_cpm)

# 打印这个矩阵，直接看非主对角线上的那个数字（例如 0.95）
print(cor_matrix)

# 根据cor_matrix开始作图(热图)

library(corrplot) # 加载包

corrplot(cor_matrix) # 画图

